{
  "blogs": [
    {
      "id": "d7ce",
      "title": "A neglected territory ",
      "body": "Balochistan is the largest province of Pakistan, which; also a silk-stocking territory of the world due to its natural resources. Despite being cherished, it is the most neglected one. Accordingly, for having their common rights, mutiny has become the best alternative for the people to take, which creates problems for national security. The local yokel demands the state to listen to their voices, and give them the right to control their resources, more provincial autonomy, part in mega schemes, plus solutions for external incomers, and the missing spirits in the province.\n\t\nThe main cause behind backwardness of Balochistan, is the actions of the higher authorities who don’t want Bal0ch people to be educated. Correspondingly, they consider Baloch as a rebellious nation. Historically, If you want to conquer a nation, “Divide and rule” which is a British policy and if you want to destroy a nation from its roots “Dig a seed of illiteracy” which has now become a tree.\n\nAdmittedly, government cannot be blamed for whole, we as a nation, also burned our hands in this gross issue. In other words, we living in a country, where women make about 49% of the whole population in which 90% are uneducated. Balochistan is a clannish province, where many clans and societies restrict girls to learn reading and writing due to their cultural limitations. Illiteracy negatively affects the society as a whole, declining employment, economic growth and social equity. Literacy level of men is also very low, owing to this, many students apply for private institutions for higher education, because of absence of facilities in government institutions, but can’t join due to poverty. \n\nImmediate actions had better be taken to introduce a modern educational system as soon as possible. Most importantly, counselling programs must be conducted for awakening people from the fake world to the real. The educational budget of Balochistan is the least compared as other provinces. In this consequence, budget has to be increased every year.\n\nPakistan is suffering from various social and economic problems together with the population increasing day by day, which is directly proportional to the poverty rate in the country. In these critical circumstances, the resource-rich province (Balochistan) can be a handy for building the economic status. For this reason, the resources have to be utilized properly. Balochistan in particular, must be treated as a special segment of Pakistan.\n",
      "author": "jahanzaib tariq"
    }
  ]
}